In [1]:
import pandas as pd
import importlib

In [11]:
dataFrame=pd.read_csv('import.csv', header=None)

In [12]:
dataFrame.head()

         0    1      2
0     Name  Reg  Marks
1  Munawar  148     45
2      Ali   44     34
3    Ahmed  150     49
4   Qadir   100     50

In [19]:
dataFrame=pd.read_table('import.csv', sep=",", names=["Sname","S_reg","S_mark"] )

In [20]:
dataFrame.head()

     Sname S_reg S_mark
0     Name   Reg  Marks
1  Munawar   148     45
2      Ali    44     34
3    Ahmed   150     49
4   Qadir    100     50

In [21]:
dataFrame=pd.read_table('import.csv', sep=",", names=["Sname","S_reg","S_mark"],skiprows=[2])

In [22]:
dataFrame

     Sname S_reg S_mark
0     Name   Reg  Marks
1  Munawar   148     45
2    Ahmed   150     49
3   Qadir    100     50
4    Raziq   308     50
5   sharif   192     48